app/Http/Controllers/Admin/MapelController.php

    public function index()
    {
        $materi = Materi::all();
        $mapel = Mapel::all();
---
select * from `materi`
select * from `mapel`

    public function show($id)
    {
        $mapel = Mapel::find($id);
        $materi = Materi::where('id_mapel', $id)->paginate(5);
---
select * from `materi` where `id_mapel` = '1' limit 5 offset 0
select count(*) as aggregate from `materi` where `id_mapel` = '1'