app/Http/Controllers/Admin/MateriController.php

    public function create()
    {
        $mapel = Mapel::all();
        $materi = Materi::all();
---
select * from `mapel`
select * from `materi`

    public function edit($id)
    {
        $mapel = Mapel::firstOrFail();
---
select * from `mapel`